In [1]:
import pandas as pd
df = pd.read_csv('P05-01.csv')

In [2]:
# Subsoal 1

df['Card_Category'].value_counts()

Card_Category
Blue        9436
Silver       555
Gold         116
Platinum      20
Name: count, dtype: int64

In [3]:
# Subsoal 2

df['Credit_Limit'].mean()

8631.953698034955

In [4]:
# Subsoal 3
df.sort_values(['Total_Trans_Amt'], ascending=False)[:5]

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Months_Inactive_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Trans_Amt,Total_Trans_Ct,Avg_Utilization_Ratio
9964,718140783,Existing Customer,47,M,4,Unknown,Married,$60K - $80K,Blue,36,5,10585.0,1749,18484,108,0.165
10073,717642633,Existing Customer,51,M,2,Graduate,Married,$60K - $80K,Blue,40,3,3750.0,1801,17995,116,0.480
10097,801036033,Existing Customer,31,M,0,High School,Single,$40K - $60K,Blue,25,2,4493.0,1388,17744,104,0.309
9601,716004258,Existing Customer,45,M,4,High School,Single,$60K - $80K,Blue,35,1,8449.0,2092,17634,120,0.248
9341,713758758,Existing Customer,48,M,2,High School,Married,Less than $40K,Silver,36,2,14581.0,2517,17628,109,0.173

In [5]:
# Subsoal 4

len(df.loc[df['Card_Category'] == 'Gold'])

116

In [6]:
# Subsoal 5

df['Customer_Age'].corr(df['Total_Trans_Amt'])

-0.04644649085468729

Karena nilai dari korelasi dekat dengan 0, maka dapat disimpulkan bahwa tidak ada korelasi ntara usia pengguna dalam bulan dengan total transaksi selama 12 bulan terakhir.